def поиска по фамилии (file_name):
    - считывает файл строкой
    - разбивает на элементы по символу-разделителю
    - возвращает список

# повторный запрос по имени (уточняем имя)
#  обращаемся к UI

def поиска по имени (file_name):


def поиска по телефону (file_name):



    return (list_of_dictionary) 
# читаем информацию из файла (можно путь до файла) и возвращаем массив словарей 
# типы файлов c БД: .csv, .json, .xml, .yaml







def export (list_of_dictionary, file_name, format): # format: .csv, .json, .xml, .yaml
    return (status) # возвращает статус: ок или не ок, если такая запись есть
file.write() # запись в файл

